### Python金融风控策略实战（Hadoop + Spark + MySQL + Python）
## <center>Pandas 读取 + 处理 MySQL 数据 >>> SQL 语句练习</center>
### <center>策略制定及验证：张君颖  ； 报告日期：2021.1.20</center>
  <font color=blue><center>作者邮箱：zhang.jun.ying@outlook.com</center></font>   
  
  <font color=blue><center>项目源代码、数据、自定义函数已上传GitHub：</center></font>   
    
<font color=blue><center>https://github.com/lotbear/Python-Financial-investment-strategy</center></font>

### 第一步：连接 MySQL 数据库，使用 pandas 查看数据整体情况
本报告以 spark 驱动算法，数据结构基于 Hadoop-yarn + MySQL 模式，实现 4 台服务器同步进行的分布式运算

In [1]:
import pymysql
import pandas as pd

print('查看 Spark 的运行模式：')
sc.master

查看 Spark 的运行模式：

'yarn'

In [2]:
# 连接 MySQL 数据库，选择对应的 database 和 table

conn = pymysql.connect(
    host='localhost',
    port=int(3306),
    user='lotbear',
    passwd='*********',
    database='data1',
    charset='utf8mb4')

df = pd.read_sql_query("SELECT * FROM german",conn)

df_copy = df.copy() # 对数据库读取的数据进行备份

print('查看数据整体信息：')
df_copy.info()

查看数据整体信息：
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 22 columns):
status_account     1000 non-null object
duration           1000 non-null int64
credit_history     1000 non-null object
purpose            1000 non-null object
amount             1000 non-null int64
svaing_account     1000 non-null object
present_emp        1000 non-null object
income_rate        1000 non-null int64
personal_status    1000 non-null object
other_debtors      1000 non-null object
residence_info     1000 non-null int64
property           1000 non-null object
age                1000 non-null int64
inst_plans         1000 non-null object
housing            1000 non-null object
num_credits        1000 non-null int64
job                1000 non-null object
dependents         1000 non-null int64
telephone          1000 non-null object
foreign_worker     1000 non-null object
target             1000 non-null int64
id                 1000 non-null int64
dtypes: int64(9), object(13)
memory usage: 172.0+ KB

In [3]:
print('查看数据最后5行：')
df_copy.tail(5)

查看数据最后5行：

,status_account,duration,credit_history,purpose,amount,svaing_account,present_emp,income_rate,personal_status,other_debtors,...,age,inst_plans,housing,num_credits,job,dependents,telephone,foreign_worker,target,id
995,A14,12,A32,A42,1736,A61,A74,3,A92,A101,...,31,A143,A152,1,A172,1,A191,A201,1,996
996,A11,30,A32,A41,3857,A61,A73,4,A91,A101,...,40,A143,A152,1,A174,1,A192,A201,1,997
997,A14,12,A32,A43,804,A61,A75,4,A93,A101,...,38,A143,A152,1,A173,1,A191,A201,1,998
998,A11,45,A32,A43,1845,A61,A73,4,A93,A101,...,23,A143,A153,1,A173,1,A192,A201,2,999
999,A12,45,A34,A41,4576,A62,A71,3,A93,A101,...,27,A143,A152,1,A173,1,A191,A201,1,1000

### >>> 将 pandas 处理过的数据传回 MySQL 生成一个新的表

In [4]:
# 导入 sql 数据库连接引擎包
import sqlalchemy

# connectstring: mysql+mysqldb://<user>:<password>@<host>[:<port>]/<dbname>
engine = sqlalchemy.create_engine('mysql+mysqldb://lotbear:*****@localhost:3306/data1')

In [5]:
%load_ext sql
%sql mysql+mysqldb://lotbear:*****@localhost:3306/data1

In [6]:
# 复制原表(german)的结构
with engine.connect() as  con:
    con.execute('DROP TABLE if exists german_00') # 判断 german_00 表是否存在，如果存在删除
    con.execute('CREATE TABLE german_00 LIKE german')  # 复制表结构

In [7]:
# 将 pandas 处理过的数据传回 MySQL
# 本例使用 "replace" 进行数据覆盖，若添加在已有数据后面，使用 "append"
df_copy.to_sql('german_00',engine,index=False,if_exists='replace')

In [8]:
%sql select * from german_00 limit 5;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
5 rows affected.

[('A11', 6, 'A34', 'A43', 1169, 'A65', 'A75', 4, 'A93', 'A101', 4, 'A121', 67, 'A143', 'A152', 2, 'A173', 1, 'A192', 'A201', 1, 1),
 ('A12', 48, 'A32', 'A43', 5951, 'A61', 'A73', 2, 'A92', 'A101', 2, 'A121', 22, 'A143', 'A152', 1, 'A173', 1, 'A191', 'A201', 2, 2),
 ('A14', 12, 'A34', 'A46', 2096, 'A61', 'A74', 2, 'A93', 'A101', 3, 'A121', 49, 'A143', 'A152', 1, 'A172', 2, 'A191', 'A201', 1, 3),
 ('A11', 42, 'A32', 'A42', 7882, 'A61', 'A74', 2, 'A93', 'A103', 4, 'A122', 45, 'A143', 'A153', 1, 'A173', 2, 'A191', 'A201', 1, 4),
 ('A11', 24, 'A33', 'A40', 4870, 'A61', 'A73', 3, 'A93', 'A101', 4, 'A124', 53, 'A143', 'A153', 2, 'A173', 2, 'A191', 'A201', 2, 5)]

In [9]:
%sql show tables;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
3 rows affected.

[('german',), ('german_00',), ('student',)]

### 如果 pandas 处理过后，数据结构发生变化，传回 MySQL 时需要重新建表结构

In [10]:
# df_copy.to_sql('german_00',engine,index=False,if_exists='replace',
#                dtype={'status_account': sqlalchemy.types.String,  
#                       'duration': sqlalchemy.types.INT,
#                       'credit_history': sqlalchemy.types.String,
#                       ......
#                  })

### >>> 使用 SQL 语句处理数据表

In [11]:
%%sql
select * from german_00
where duration > 55 and status_account = 'A14';

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
5 rows affected.

[('A14', 60, 'A32', 'A43', 10144, 'A62', 'A74', 2, 'A92', 'A101', 4, 'A121', 21, 'A143', 'A152', 1, 'A173', 1, 'A192', 'A201', 1, 135),
 ('A14', 60, 'A34', 'A40', 13756, 'A65', 'A75', 2, 'A93', 'A101', 4, 'A124', 63, 'A141', 'A153', 1, 'A174', 1, 'A192', 'A201', 1, 374),
 ('A14', 60, 'A33', 'A43', 15653, 'A61', 'A74', 2, 'A93', 'A101', 4, 'A123', 21, 'A143', 'A152', 2, 'A173', 1, 'A192', 'A201', 1, 638),
 ('A14', 60, 'A32', 'A40', 10366, 'A61', 'A75', 2, 'A93', 'A101', 4, 'A122', 42, 'A143', 'A152', 1, 'A174', 1, 'A192', 'A201', 1, 673),
 ('A14', 60, 'A32', 'A40', 6527, 'A65', 'A73', 4, 'A93', 'A101', 4, 'A124', 34, 'A143', 'A153', 1, 'A173', 2, 'A192', 'A201', 1, 686)]

### >>> 防止原始数据被改动，新建一个备份表进行数据处理

In [12]:
%%sql
create table german_01 as 
select * from german_00;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1000 rows affected.

[]

### >>> 若原数据没有 primary key 先添加 / 设置

In [13]:
# %%sql alter table german_00
# add id int not null auto_increment primary key;

# %%sql alter table german_01
# set id int not null auto_increment primary key;

### >>> 原数据分类 target =1 ，2  改为  target =0 ，1

In [14]:
%sql select distinct target from german_01; # 原数据 target 分类取值为 1，2

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
2 rows affected.

[(1,), (2,)]

In [15]:
%sql update german_01 set target = target-1;  # 将 target -1 分类取值为 0，1

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1000 rows affected.

[]

In [16]:
%sql select distinct target from german_01;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
2 rows affected.

[(0,), (1,)]

### >>> 添加脏数据 + 数据清洗

In [17]:
%%sql update german_01 
set status_account = concat('#%$',status_account) 
where status_account = 'A14';

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
394 rows affected.

[]

In [18]:
%sql select distinct status_account from german_01;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
4 rows affected.

[('A11',), ('A12',), ('#%$A14',), ('A13',)]

In [19]:
%%sql update german_01 
set status_account = 'A14' 
where status_account like '%#%';

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
394 rows affected.

[]

In [20]:
%sql select distinct status_account from german_01;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
4 rows affected.

[('A11',), ('A12',), ('A14',), ('A13',)]

### >>> 添加时间数据 loanday , payday     

日期数据转换为时间戳： UNIX_TIMESTAMP（date）   

时间戳数据转换为日期： FROM_UNIXTIME(unix_timestamp,format)

In [21]:
%sql SELECT unix_timestamp ('2020-12-31') as to_timestamp;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1 rows affected.

[(1609344000,)]

In [22]:
%sql SELECT from_unixtime (1609344000,'%Y-%m-%d') as from_timestamp;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1 rows affected.

[('2020-12-31',)]

In [23]:
%sql select id, duration, age from german_01 limit 5;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
5 rows affected.

[(1, 6, 67), (2, 48, 22), (3, 12, 49), (4, 42, 45), (5, 24, 53)]

In [24]:
%%sql alter table german_01
add loanday date not null default '1970-01-01',
add payday date not null default '2020-12-31';

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
0 rows affected.

[]

In [25]:
%sql select min(age), max(age) from german_01;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1 rows affected.

[(19, 75)]

#### >>> 除法取整 5 div 2 = 2 , 除法取余数 5 mod 2 =1 , 四舍五入 round ( 1.5 ) = 2

In [26]:
%%sql update german_01  
set loanday = loanday + age mod 3;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1000 rows affected.

[]

In [27]:
%%sql update german_01 
set payday = payday - age div 3;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1000 rows affected.

[]

In [28]:
%sql select id, duration, age , loanday, payday from german_01 limit 5;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
5 rows affected.

[(1, 6, 67, datetime.date(1970, 1, 2), datetime.date(2020, 12, 9)),
 (2, 48, 22, datetime.date(1970, 1, 2), datetime.date(2020, 12, 24)),
 (3, 12, 49, datetime.date(1970, 1, 2), datetime.date(2020, 12, 15)),
 (4, 42, 45, datetime.date(1970, 1, 1), datetime.date(2020, 12, 16)),
 (5, 24, 53, datetime.date(1970, 1, 3), datetime.date(2020, 12, 14))]

In [29]:
%%sql 
select status_account, income_rate, avg(age)
from german_01
where status_account != 'A11'
group by status_account, income_rate
having count(*)>=33
order by avg(age) desc limit 10;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
8 rows affected.

[('A14', 4, Decimal('37.6667')),
 ('A14', 2, Decimal('35.9326')),
 ('A14', 1, Decimal('35.4400')),
 ('A12', 2, Decimal('34.8358')),
 ('A12', 4, Decimal('34.5169')),
 ('A14', 3, Decimal('34.1270')),
 ('A12', 3, Decimal('33.4048')),
 ('A12', 1, Decimal('32.3333'))]

In [30]:
%sql select month(payday) as pay_month from german_01 limit 5;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
5 rows affected.

[(12,), (12,), (12,), (12,), (12,)]

In [31]:
%sql select loanday+(age*60) as new_loanday from german_01 limit 5;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
5 rows affected.

[(19704122,), (19701422,), (19703042,), (19702801,), (19703283,)]

In [32]:
%sql select payday-(age*60) as new_payday from german_01 limit 5;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
5 rows affected.

[(20197189,), (20199904,), (20198275,), (20198516,), (20198034,)]

In [33]:
%sql show tables;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
4 rows affected.

[('german',), ('german_00',), ('german_01',), ('student',)]

### >>> 联接 2 张表，显示选出的数据列

In [34]:
%%sql select g0.status_account, g1.loanday, g1.payday
from german_00 as g0, german_01 as g1
where g0.id = g1.id limit 5;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
5 rows affected.

[('A11', datetime.date(1970, 1, 2), datetime.date(2020, 12, 9)),
 ('A12', datetime.date(1970, 1, 2), datetime.date(2020, 12, 24)),
 ('A14', datetime.date(1970, 1, 2), datetime.date(2020, 12, 15)),
 ('A11', datetime.date(1970, 1, 1), datetime.date(2020, 12, 16)),
 ('A11', datetime.date(1970, 1, 3), datetime.date(2020, 12, 14))]

In [35]:
%sql describe german_01;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
24 rows affected.

[('status_account', 'text', 'YES', '', None, ''),
 ('duration', 'bigint', 'YES', '', None, ''),
 ('credit_history', 'text', 'YES', '', None, ''),
 ('purpose', 'text', 'YES', '', None, ''),
 ('amount', 'bigint', 'YES', '', None, ''),
 ('svaing_account', 'text', 'YES', '', None, ''),
 ('present_emp', 'text', 'YES', '', None, ''),
 ('income_rate', 'bigint', 'YES', '', None, ''),
 ('personal_status', 'text', 'YES', '', None, ''),
 ('other_debtors', 'text', 'YES', '', None, ''),
 ('residence_info', 'bigint', 'YES', '', None, ''),
 ('property', 'text', 'YES', '', None, ''),
 ('age', 'bigint', 'YES', '', None, ''),
 ('inst_plans', 'text', 'YES', '', None, ''),
 ('housing', 'text', 'YES', '', None, ''),
 ('num_credits', 'bigint', 'YES', '', None, ''),
 ('job', 'text', 'YES', '', None, ''),
 ('dependents', 'bigint', 'YES', '', None, ''),
 ('telephone', 'text', 'YES', '', None, ''),
 ('foreign_worker', 'text', 'YES', '', None, ''),
 ('target', 'bigint', 'YES', '', None, ''),
 ('id', 'bigint', 'YES', '', None, ''),
 ('loanday', 'date', 'NO', '', '1970-01-01', ''),
 ('payday', 'date', 'NO', '', '2020-12-31', '')]

### >>> 生日 /  当前日期 --> 年龄

In [36]:
%sql drop table student;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
0 rows affected.

[]

In [37]:
%%sql create table student(
    id int not null auto_increment,   
    name text,
    birthday date,
    primary key (id)
) engine = InnoDB default charset = utf8mb4;  # utf8mb4 为中文

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
0 rows affected.

[]

In [38]:
%sql describe student;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
3 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('name', 'text', 'YES', '', None, ''),
 ('birthday', 'date', 'YES', '', None, '')]

In [39]:
%%sql insert into student
values(1, '张三', '1970-10-01');

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1 rows affected.

[]

In [40]:
%%sql insert into student
values(2, '李四', '1990-10-01');

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1 rows affected.

[]

In [41]:
%%sql insert into student
values(3, '王五', '2002-10-01');

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1 rows affected.

[]

In [42]:
%%sql insert into student
values(4, 'lotbear', '2003-10-01');

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1 rows affected.

[]

In [43]:
%sql select * from student;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
4 rows affected.

[(1, '张三', datetime.date(1970, 10, 1)),
 (2, '李四', datetime.date(1990, 10, 1)),
 (3, '王五', datetime.date(2002, 10, 1)),
 (4, 'lotbear', datetime.date(2003, 10, 1))]

转换为年龄的查询语句，使用函数 TIMESTAMPDIFF

In [44]:
%%sql SELECT id, name, birthday, 
timestampdiff(year, student.birthday, curdate()) as age 
from student;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
4 rows affected.

[(1, '张三', datetime.date(1970, 10, 1), 50),
 (2, '李四', datetime.date(1990, 10, 1), 30),
 (3, '王五', datetime.date(2002, 10, 1), 18),
 (4, 'lotbear', datetime.date(2003, 10, 1), 17)]

### >>> MySQL日期函数与日期转换格式化函数大全   

https://www.jb51.net/article/135803.htm

In [45]:
%sql select date_format('2013-03-09','%Y-%m-%d') as date_format;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1 rows affected.

[('2013-03-09',)]

In [46]:
%sql select STR_TO_DATE('2012-10-11 16:42:30','%Y-%m-%d %H:%i:%s') as STR_TO_DATE;

 * mysql+mysqldb://lotbear:***@localhost:3306/data1
1 rows affected.

[(datetime.datetime(2012, 10, 11, 16, 42, 30),)]

### >>> MySQL 数据类型： 数值 / 日期 / 字符串  

https://www.runoob.com/mysql/mysql-data-types.html

### >>>  DDL 语句中的 alter 与 DML 语句中的 update 对比

在表中添加列:   

ALTER TABLE table_name   
ADD column_name datatype   

删除表中的列：   

ALTER TABLE table_name   
DROP COLUMN column_name   

改变表中列的数据类型，不改变列名：   

ALTER TABLE table_name   
MODIFY COLUMN column_name datatype   

改变表中列名：   

ALTER TABLE table_name 
RENAME COLUMN column_name to new_name;   

改变表中列的数据类型，且改变列名：  

ALTER TABLE table_name 
CHANGE COLUMN column_name new_name datatype;

改变数据值：  

UPDATE table_name    
SET field1=new-value1, field2=new-value2